yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l151f2.h
#define SYSCFG_RMPCR3_SPI1_REMAP SYSCFG_RMPCR3_bit.SPI1_REMAP
#define SYSCFG_RMPCR3_USART3TR_REMAP SYSCFG_RMPCR3_bit.USART3TR_REMAP
#define SYSCFG_RMPCR3_USART3CK_REMAP SYSCFG_RMPCR3_bit.USART3CK_REMAP
#define SYSCFG_RMPCR3_TIM3_CH1_REMAP SYSCFG_RMPCR3_bit.TIM3_CH1_REMAP
#define SYSCFG_RMPCR3_TIM3_CH2_REMAP SYSCFG_RMPCR3_bit.TIM3_CH2_REMAP
#define SYSCFG_RMPCR3_CCO_REMAP  SYSCFG_RMPCR3_bit.CCO_REMAP
#define SYSCFG_RMPCR3_TIM2_CH1_REMAP SYSCFG_RMPCR3_bit.TIM2_CH1_REMAP
#define SYSCFG_RMPCR3_TIM2_CH2_REMAP SYSCFG_RMPCR3_bit.TIM2_CH2_REMAP

#endif

/*-------------------------------------------------------------------------
 *      REMAP bit masks
 *-----------------------------------------------------------------------*/
#define MASK_SYSCFG_RMPCR1_ADC1DMA_REMAP 0x03
#define MASK_SYSCFG_RMPCR1_TIM4DMA_REMAP 0x0C
#define MASK_SYSCFG_RMPCR1_USART1TR_REMAP 0x30
#define MASK_SYSCFG_RMPCR1_USART1CK_REMAP 0x40
#define MASK_SYSCFG_RMPCR1_SPI1_REMAP 0x80

#define MASK_SYSCFG_RMPCR2_ADC1TRIG_REMAP 0x01
#define MASK_SYSCFG_RMPCR2_TIM2TRIG_REMAP 0x02
#define MASK_SYSCFG_RMPCR2_TIM3TRIG_REMAP 0x04
#define MASK_SYSCFG_RMPCR2_TIM2TRIGLSE_REMAP 0x08
#define MASK_SYSCFG_RMPCR2_TIM3TRIGLSE_REMAP 0x10
#define MASK_SYSCFG_RMPCR2_SPI2_REMAP 0x20
#define MASK_SYSCFG_RMPCR2_TIM3TRIG_REMAP2 0x40
#define MASK_SYSCFG_RMPCR2_TIM23BKIN_REMAP 0x80

#define MASK_SYSCFG_RMPCR3_SPI1_REMAP 0x01
#define MASK_SYSCFG_RMPCR3_USART3TR_REMAP 0x02
#define MASK_SYSCFG_RMPCR3_USART3CK_REMAP 0x04
#define MASK_SYSCFG_RMPCR3_TIM3_CH1_REMAP 0x08
#define MASK_SYSCFG_RMPCR3_TIM3_CH2_REMAP 0x10
#define MASK_SYSCFG_RMPCR3_CCO_REMAP 0x20
#define MASK_SYSCFG_RMPCR3_TIM2_CH1_REMAP 0x40
#define MASK_SYSCFG_RMPCR3_TIM2_CH2_REMAP 0x80


/*-------------------------------------------------------------------------
 *      ITC - EXTI register definitions
 *-----------------------------------------------------------------------*/
/* External interrupt control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char P0IS        : 2;
  unsigned char P1IS        : 2;
  unsigned char P2IS        : 2;
  unsigned char P3IS        : 2;
} __BITS_EXTI_CR1;
#endif
__IO_REG8_BIT(EXTI_CR1,    0x50A0, __READ_WRITE, __BITS_EXTI_CR1);

/* External interrupt control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char P4IS        : 2;
  unsigned char P5IS        : 2;
  unsigned char P6IS        : 2;
  unsigned char P7IS        : 2;
} __BITS_EXTI_CR2;
#endif
__IO_REG8_BIT(EXTI_CR2,    0x50A1, __READ_WRITE, __BITS_EXTI_CR2);

/* External interrupt control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PBIS        : 2;
  unsigned char PDIS        : 2;
  unsigned char PEIS        : 2;
  unsigned char PFIS        : 2;
} __BITS_EXTI_CR3;
#endif
__IO_REG8_BIT(EXTI_CR3,    0x50A2, __READ_WRITE, __BITS_EXTI_CR3);

/* External interrupt status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char P0F         : 1;
  unsigned char P1F         : 1;
  unsigned char P2F         : 1;
  unsigned char P3F         : 1;
  unsigned char P4F         : 1;
  unsigned char P5F         : 1;
  unsigned char P6F         : 1;
  unsigned char P7F         : 1;
} __BITS_EXTI_SR1;
#endif
__IO_REG8_BIT(EXTI_SR1,    0x50A3, __READ_WRITE, __BITS_EXTI_SR1);

/* External interrupt status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PBF         : 1;
  unsigned char PDF         : 1;
  unsigned char PEF         : 1;
  unsigned char PFF         : 1;
} __BITS_EXTI_SR2;
#endif
__IO_REG8_BIT(EXTI_SR2,    0x50A4, __READ_WRITE, __BITS_EXTI_SR2);

/* External interrupt port select register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PBLIS       : 1;
  unsigned char PBHIS       : 1;
  unsigned char PDLIS       : 1;
  unsigned char PDHIS       : 1;
  unsigned char PELIS       : 1;
  unsigned char PEHIS       : 1;
  unsigned char PFLIS       : 1;
  unsigned char PFES        : 1;
} __BITS_EXTI_CONF1;
#endif
__IO_REG8_BIT(EXTI_CONF1,  0x50A5, __READ_WRITE, __BITS_EXTI_CONF1);

/* External interrupt control register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PGIS        : 2;
  unsigned char PHIS        : 2;
} __BITS_EXTI_CR4;
#endif
__IO_REG8_BIT(EXTI_CR4,    0x50AA, __READ_WRITE, __BITS_EXTI_CR4);

/* External interrupt port select register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PFHIS       : 1;
  unsigned char PGLIS       : 1;
  unsigned char PGHIS       : 1;
  unsigned char PHLIS       : 1;
  unsigned char PHHIS       : 1;
  unsigned char PGBS        : 1;
  unsigned char PHDS        : 1;
} __BITS_EXTI_CONF2;
#endif
__IO_REG8_BIT(EXTI_CONF2,  0x50AB, __READ_WRITE, __BITS_EXTI_CONF2);


/*-------------------------------------------------------------------------
 *      ITC - EXTI bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define EXTI_CR1_P0IS            EXTI_CR1_bit.P0IS
#define EXTI_CR1_P1IS            EXTI_CR1_bit.P1IS
#define EXTI_CR1_P2IS            EXTI_CR1_bit.P2IS
#define EXTI_CR1_P3IS            EXTI_CR1_bit.P3IS

#define EXTI_CR2_P4IS            EXTI_CR2_bit.P4IS
#define EXTI_CR2_P5IS            EXTI_CR2_bit.P5IS
#define EXTI_CR2_P6IS            EXTI_CR2_bit.P6IS
#define EXTI_CR2_P7IS            EXTI_CR2_bit.P7IS

#define EXTI_CR3_PBIS            EXTI_CR3_bit.PBIS
#define EXTI_CR3_PDIS            EXTI_CR3_bit.PDIS
#define EXTI_CR3_PEIS            EXTI_CR3_bit.PEIS
#define EXTI_CR3_PFIS            EXTI_CR3_bit.PFIS

#define EXTI_SR1_P0F             EXTI_SR1_bit.P0F
#define EXTI_SR1_P1F             EXTI_SR1_bit.P1F
#define EXTI_SR1_P2F             EXTI_SR1_bit.P2F
#define EXTI_SR1_P3F             EXTI_SR1_bit.P3F
#define EXTI_SR1_P4F             EXTI_SR1_bit.P4F
#define EXTI_SR1_P5F             EXTI_SR1_bit.P5F
#define EXTI_SR1_P6F             EXTI_SR1_bit.P6F
#define EXTI_SR1_P7F             EXTI_SR1_bit.P7F

